alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E16B.atdf
        <register name="APBDMASK" offset="0x20" rw="RW" size="4" initval="0x000000FF" caption="APBD Mask">
          <bitfield name="EVSYS_" caption="EVSYS APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Clock Enable" mask="0x2"/>
          <bitfield name="TC4_" caption="TC4 APB Clock Enable" mask="0x4"/>
          <bitfield name="ADC_" caption="ADC APB Clock Enable" mask="0x8"/>
          <bitfield name="AC_" caption="AC APB Clock Enable" mask="0x10"/>
          <bitfield name="PTC_" caption="PTC APB Clock Enable" mask="0x20"/>
          <bitfield name="OPAMP_" caption="OPAMP APB Clock Enable" mask="0x40"/>
          <bitfield name="CCL_" caption="CCL APB Clock Enable" mask="0x80"/>
        </register>
        <register name="APBEMASK" offset="0x24" rw="RW" size="4" initval="0x0000000D" caption="APBE Mask">
          <bitfield name="PAC_" caption="PAC APB Clock Enable" mask="0x1"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
      <value-group name="MCLK_LPDIV__LPDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
      <value-group name="MCLK_BUPDIV__BUPDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MTB" id="U2002" version="1.0.0" caption="Cortex-M0+ Micro-Trace Buffer">
      <register-group name="MTB" caption="Cortex-M0+ Micro-Trace Buffer">
        <register name="POSITION" offset="0x0" rw="RW" size="4" access-size="4" caption="MTB Position">
          <bitfield name="WRAP" caption="Pointer Value Wraps" mask="0x4"/>
          <bitfield name="POINTER" caption="Trace Packet Location Pointer" mask="0xFFFFFFF8"/>
        </register>
        <register name="MASTER" offset="0x4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Master">
          <bitfield name="MASK" caption="Maximum Value of the Trace Buffer in SRAM" mask="0x1F"/>
          <bitfield name="TSTARTEN" caption="Trace Start Input Enable" mask="0x20"/>
          <bitfield name="TSTOPEN" caption="Trace Stop Input Enable" mask="0x40"/>
          <bitfield name="SFRWPRIV" caption="Special Function Register Write Privilege" mask="0x80"/>
          <bitfield name="RAMPRIV" caption="SRAM Privilege" mask="0x100"/>
          <bitfield name="HALTREQ" caption="Halt Request" mask="0x200"/>
          <bitfield name="EN" caption="Main Trace Enable" mask="0x80000000"/>
        </register>
        <register name="FLOW" offset="0x8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="MTB Flow">
          <bitfield name="AUTOSTOP" caption="Auto Stop Tracing" mask="0x1"/>
          <bitfield name="AUTOHALT" caption="Auto Halt Request" mask="0x2"/>
          <bitfield name="WATERMARK" caption="Watermark value" mask="0xFFFFFFF8"/>
        </register>
        <register name="BASE" offset="0xC" rw="R" size="4" access-size="4" caption="MTB Base">
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="MTB Integration Mode Control">
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="MTB Claim Set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="MTB Claim Clear">
        </register>
        <register name="LOCKACCESS" offset="0xFB0" rw="RW" size="4" access-size="4" caption="MTB Lock Access">
        </register>
        <register name="LOCKSTATUS" offset="0xFB4" rw="R" size="4" access-size="4" caption="MTB Lock Status">
        </register>
        <register name="AUTHSTATUS" offset="0xFB8" rw="R" size="4" access-size="4" caption="MTB Authentication Status">
        </register>
        <register name="DEVARCH" offset="0xFBC" rw="R" size="4" access-size="4" caption="MTB Device Architecture">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="MTB Device Configuration">
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="MTB Device Type">
        </register>
        <register name="PID4" offset="0xFD0" rw="R" size="4" access-size="4" caption="Peripheral Identification 4">
        </register>
        <register name="PID5" offset="0xFD4" rw="R" size="4" access-size="4" caption="Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0xFD8" rw="R" size="4" access-size="4" caption="Peripheral Identification 6">
        </register>
