alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E16B.atdf
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSCRDY" caption="XOSC Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready Interrupt Enable" mask="0x10"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready Interrupt Enable" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds Interrupt Enable" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine Interrupt Enable" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse Interrupt Enable" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped Interrupt Enable" mask="0x1000"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise Interrupt Enable" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall Interrupt Enable" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Time Out Interrupt Enable" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready Interrupt Enable" mask="0x80000"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready" mask="0x10"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x1000"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x20000"/>
          <bitfield name="DPLLLTO" caption="DPLL Timeout" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready" mask="0x80000"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready" mask="0x10"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x1000"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x20000"/>
          <bitfield name="DPLLTO" caption="DPLL Timeout" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready" mask="0x80000"/>
        </register>
        <register name="XOSCCTRL" offset="0x10" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000"/>
        </register>
        <register name="OSC16MCTRL" offset="0x14" rw="RW" size="1" initval="0x82" caption="16MHz Internal Oscillator (OSC16M) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="FSEL" caption="Oscillator Frequency Select" mask="0xC" values="OSCCTRL_OSC16MCTRL__FSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="DFLLCTRL" offset="0x18" rw="RW" size="2" initval="0x0080" caption="DFLL48M Control">
          <bitfield name="ENABLE" caption="DFLL Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode Selection" mask="0x4"/>
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x8"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x10"/>
          <bitfield name="USBCRM" caption="USB Clock Recovery Mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x100"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x200"/>
          <bitfield name="BPLCKC" caption="Bypass Coarse Lock" mask="0x400"/>
          <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x800"/>
        </register>
        <register name="DFLLVAL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="DFLL48M Value">
          <bitfield name="FINE" caption="Fine Value" mask="0x3FF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0x3FF0000"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
        </register>
